import 'package:watch_it/features/home/data/model/video_model.dart';

final List<VideoModel> videos = [
  VideoModel(
    title: "الحصة الأولى قواعد نحوية وشرح أركان الجملة الاسمية  |اللغة العربية | الصف الرابع الابتدائي الترم 2",
    id: "2I08fCrrkWk",
  ),
  VideoModel(
    title: "الحصة الأولى القواعد النحوية أنواع الجموع |اللغة العربية | الصف الثالث الابتدائي ترم 2 مستر السقا",
    id: "7ox7phKHLOA",
  ),
  VideoModel(
    title: "الحصة الأولى الدرس الأول خاصية التجميع في الضرب | رياضيات | الصف الثالث الابتدائي الترم الثاني",
    id: "VIB3_k3lb0A",
  ),
  VideoModel(
    title: "الحصة السابعة قواعد نحوية الاسم والفعل والحرف |اللغة العربية | الصف الثالث الابتدائي مستر محمد السقا",
    id: "1oB42PnLgdk",
  ),
  VideoModel(
    title: "الحصة الأولى الكسور الاعتيادية وكسر الوحدة رياضيات| الصف الرابع الابتدائي الترم الثاني مستر السقا",
    id: "7ELO9Cw9CsI",
  ),
  VideoModel(
    title: "الحصة الأولى الأشكال الهندسية المختلفة |رياضيات | الصف الأول الابتدائي الترم الثاني مستر محمد السقا",
    id: "t1UCc0lQiTg",
  ),
  VideoModel(
    title: "الحصة الأولى منهج 2026 الأعداد الكبيرة رياضيات | الصف الرابع الابتدائي مستر محمد السقا تعليم زمان",
    id: "lo2KkgSLqfk",
  ),
  VideoModel(
    title: "الحصة السابعة جمع الأعداد الكسرية على خط الأعداد رياضيات| الصف الرابع الابتدائي مستر محمد السقا",
    id: "YCwaSMNjHpU",
  ),
  VideoModel(
    title: "الحصة 2 تدريبات على الكسور وتحليل الكسر الاعتيادي رياضيات| الصف الرابع الابتدائي مستر محمد السقا",
    id: "gKpuU8rIJ70",
  ),
  VideoModel(
    title: "الحصة السابعة وشرح الأفعال مع المثنى قواعد نحوية |اللغة العربية | الصف الرابع الابتدائي مستر السقا",
    id: "FWFHvJxRldk",
  ),
  VideoModel(
    title: "الحصة السادسة قواعد نحوية الجملة الفعلية |اللغة العربية | الصف الرابع الابتدائي مستر محمد السقا",
    id: "LVO4Sg9ZFKc",
  ),
  VideoModel(
    title: "الحصة الثالثة قواعد نحوية المفعول المطلق | اللغة العربية | الصف الخامس الابتدائي مستر محمد السقا",
    id: "gXII_JwnFZE",
  ),
  VideoModel(
    title: "الحصة الأولى نص الاستماع سطح ينير الحي اللغة العربية | الصف الخامس الابتدائي الترم الثاني",
    id: "bZCe53BV-RA",
  ),
  VideoModel(
    title: "الحصة الثانية قراءة أخلاقيات استخدام الإنترنت |اللغة العربية| الصف الخامس الابتدائي مستر محمد السقا",
    id: "v41RjHKvUQM",
  ),
  VideoModel(
    title: "الحصة الثانية وشرح الجملة الفعلية والمفعول به |قواعد نحوية لغة عربية | الصف الخامس الابتدائي",
    id: "1oinjh51SzM",
  ),
  VideoModel(
    title: "الحصة الأولى وشرح نص الاستماع سر الحياة |اللغة العربية | الصف الخامس الابتدائي مستر محمد السقا",
    id: "dRZIMn5fM78",
  ),
  VideoModel(
    title: "الحصة الأولى استكشاف النقود |رياضيات| الصف الثاني الابتدائي الترم الثاني مستر محمد السقا",
    id: "IT1-pskEf70",
  ),
  VideoModel(
    title: "الحصة الأولى نص الاستماع لوحتي |اللغة العربية | الصف الثاني الابتدائي مستر محمد السقا",
    id: "M5kZ7Kr14BU",
  ),
  VideoModel(
    title: "الحصة الأولى الدرس الأول اسم الله العليم التربية الدينية| الصف الثاني الابتدائي مستر محمد السقا",
    id: "13WQmssJf5A",
  ),
  VideoModel(
    title: "الحصة الأولى تأسيس للعام القادم |رياضيات | الصف الثاني الابتدائي مستر محمد السقا تعليم زمان",
    id: "257e9hTDx5M",
  ),
];